IDEA Open Model
RebarShape.SourceGeometry Property
Compatible with IDEA StatiCa 20.1
 Gets or sets the segments of the rebar shape.
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public RebarPolyLine3D SourceGeometry { get; set; }
Public Property SourceGeometry As RebarPolyLine3D
	Get
	Set
Property Value
Type: RebarPolyLine3D
See Also
Reference
RebarShape Class
IdeaRS.OpenModel.Model Namespace